---
type: WorksetKindFilter
namespace: Autodesk.Revit.DB
version: 2024
members: 2
tags: [revit-api, class]
---

# WorksetKindFilter

`Autodesk.Revit.DB.WorksetKindFilter` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | WorksetKindFilter | — | `` |
| Property | WorksetKind | 2012 | `public WorksetKind WorksetKind { get ; }` |